---
title:  "kFS: A tiny toy File System"
category: posts
date: 2024-09-11
excerpt: "A tiny file system like ext2, based on Inode, including Disk Part, File managing part, User part."
---

[TOC]
## attention
use **make** to compile all the src files

# step1

## input & output

open 2 terminals, one for BDS:

```shell
./BDS <diskfile> <#cylinders> <#sector per cylinder> <track-to-track delay> <port=10356>
```
for example:

```shell
./BDS DF0 2 2 10 10356
```

### BDC_command

if you want to use the BDC_command, type:

```shell
./BDC_command <serveraddress> <port>
```

for example:

```shell
./BDC_command 192.168.200.128 10356
```

there is a trouble for me: I can not use localhost directly, I must type 192.168.200.128 instead.

And the client will wait for your input

```shell
Connected to BDS. Type commands:
>
```

you'd better use I command to know how many cylinders or sectros per cylinder:

```shell
> I
Server response: 2 2
```

And then you can use R c s and W c s l data to read and write on the disk. Remember to use E command to exit:

```shell
> W 0 0 5 hello
Server response: Yes

> R 0 0
Server response: Yes hello
...
> E
Server response: Total seek time: xx microseconds
```

### BDC_random

```shell
./BDC_random <serveraddress> <port> 
```

for example

```shell
./BDC_random 192.168.200.128 10356
```

then the client will first tell you the size of the disk and  wait for your R/W requests number:

```shell
Disk size: 2 cylinders, 2 sectors
Enter the number of R/W requests:
```

you type  a number, such as 10 and then the result will be:

```
Disk size: 2 cylinders, 2 sectors
Enter the number of R/W requests: 10
Request 0: W 1 0 256 71i0Rkk*1LkQ46d2Dqtau4Pn1cU;tZ8G'#Xsn_};-&)\<)n{z!^r5J|FISa@/6#P9uEDq^_ e$v=.#T*$48S_6y*jvd5.$fbyGBl(=))B;`PX7tve/K`E`'KYka#+c!AFCIhalq?*no|'!ul0BOp%pWxwT7%99FzvodYxX4$b?"iA3qQV\]uN7+HkBMA[/=n:#I4u^RY}o^Z$RHtJ''yX2]`UF#LUZ<+w"ZozHd5S_pXM:hw[p.6>kvs35\$oxJh
Response: Yes


Request 1: W 0 0 256 2htb>UT2>*z7e(F7GM/Va^4!O/KT_kcrVYV0JFBhP><Qa|i*K4`H/uJx@1N!9N/+C!;nG]r37J!xH&>0T!Xc2>^RPHmiv9t<:KF|*TK[!LVcR0sC1N(]lfKX1;]CTmy*:A(^2n<3<.2+>(NjpVIxYuS&L2c<"_FV"i74YSa1{t<;8&A*wk$R|qrJ@Wf\8H4U3K%l:g 7wVmK]0UV7sD5g8yC+a!D,55Y{:H7=bi6:ra3>RiVHI'Ka#nm oM,@bf=
Response: Yes


Request 2: W 0 0 256 <.tlbhjv(X{x<G"gD?qM?|6fYxhv3N#ivwqZ{wl@R&:nMVr-u!uQ -SY(=kUko@c$MY<GH\yN2%7iw^zyUg5c<*'su\z"8yA!U]H9U]#g}Tlv4i-jl\i+fp:xh7z<2W=#6"<kyYox/]-^HTdQ3O\5[2/_IF7\}nyPp8Wl-H"=(/{jd{=wL5.CHX$- U%9E!iR9CZF'\}Il66R3mey?/>#g\0#36=Y7B-j!gL)_LRM|$;2.<GMLfPOD`mr2FgIht5
Response: Yes


Request 3: R 0 1
Response: Yes 

Request 4: R 1 0
Response: Yes 71i0Rkk*1LkQ46d2Dqtau4Pn1cU;tZ8G'#Xsn_};-&)\<)n{z!^r5J|FISa@/6#P9uEDq^_ e$v=.#T*$48S_6y*jvd5.$fbyGBl(=))B;`PX7tve/K`E`'KYka#+c!AFCIhalq?*no|'!ul0BOp%pWxwT7%99FzvodYxX4$b?"iA3qQV\]uN7+HkBMA[/=n:#I4u^RY}o^Z$RHtJ''yX2]`UF#LUZ<+w"ZozHd5S_pXM:hw[p.6>kvs35\$oxJh

Request 5: R 1 0
Response: Yes 71i0Rkk*1LkQ46d2Dqtau4Pn1cU;tZ8G'#Xsn_};-&)\<)n{z!^r5J|FISa@/6#P9uEDq^_ e$v=.#T*$48S_6y*jvd5.$fbyGBl(=))B;`PX7tve/K`E`'KYka#+c!AFCIhalq?*no|'!ul0BOp%pWxwT7%99FzvodYxX4$b?"iA3qQV\]uN7+HkBMA[/=n:#I4u^RY}o^Z$RHtJ''yX2]`UF#LUZ<+w"ZozHd5S_pXM:hw[p.6>kvs35\$oxJh

Request 6: R 0 1
Response: Yes 

Request 7: R 0 0
Response: Yes <.tlbhjv(X{x<G"gD?qM?|6fYxhv3N#ivwqZ{wl@R&:nMVr-u!uQ -SY(=kUko@c$MY<GH\yN2%7iw^zyUg5c<*'su\z"8yA!U]H9U]#g}Tlv4i-jl\i+fp:xh7z<2W=#6"<kyYox/]-^HTdQ3O\5[2/_IF7\}nyPp8Wl-H"=(/{jd{=wL5.CHX$- U%9E!iR9CZF'\}Il66R3mey?/>#g\0#36=Y7B-j!gL)_LRM|$;2.<GMLfPOD`mr2FgIht5

Request 8: R 1 0
Response: Yes 71i0Rkk*1LkQ46d2Dqtau4Pn1cU;tZ8G'#Xsn_};-&)\<)n{z!^r5J|FISa@/6#P9uEDq^_ e$v=.#T*$48S_6y*jvd5.$fbyGBl(=))B;`PX7tve/K`E`'KYka#+c!AFCIhalq?*no|'!ul0BOp%pWxwT7%99FzvodYxX4$b?"iA3qQV\]uN7+HkBMA[/=n:#I4u^RY}o^Z$RHtJ''yX2]`UF#LUZ<+w"ZozHd5S_pXM:hw[p.6>kvs35\$oxJh

Request 9: R 1 1
Response: Yes 
```

## error detection

if you type the wrong command to lanuch these programs, it will alarm you the right type:

```shell
Usage: ./BDS <DiskFileName> <#cylinders> <#sector per cylinder> <track-to-track delay> <port=10356>

Usage: ./BDC_random <hostname> <port> 

Usage: ./BDC_command <ServerAddress> <Port>
```

when you use the BDC_command, if you R/W beyond the disk size, it will response you "No"

```shell
> W 32 33 5 hello
Server response: No

> R 100 100
Server response: No
```

# step2

## lanuch

you need to open 3 terminals, one for BDS, one for FS and one for FC.

```shell
/BDS <DiskFileName> <#cylinders> <#sector per cylinder> <track-to-track delay> <port=10356>

./FS <DiskServerAddress> <BDSPort=10356> <FSPort=12356>

./FC <ServerAddr> <FSPort=12356>
```

for example

```shell
./BDS DF1 32 32  10 10356

./FS 192.168.200.128 10356 12356

./FC 192.168.200.128 12355
```

note that if shows that: ERROR on binding: Address already in use, you need to change the port to another one, such as change 10356 to 10355 or change 12356 to 12355

## client command test

when you lanuch the 3 programs, then type in the client.

**note that you must use "f" to format a new disk, otherwise it will result in unknown error.**

and there is a short demo:

```
wkm@wkm-virtual-machine:~/OSProjects/PROJ3/step2/build$ ./FC 192.168.200.128 12356
Connected to FS. Type commands:
WKM-fs:/ $ f
Server response: Formatted

WKM-fs:/ $ mk file1
Server response: Created

WKM-fs:/ $ mkdir dir1
Server response: Created

WKM-fs:/ $ w file1 10 hello math
Server response: Written

WKM-fs:/ $ cat file1
Server response: hello mathRead

WKM-fs:/ $ ls
Server response: File Valid file1 10 Sat Feb 13 06:50:28 53554388
Dir Valid dir1 0 Wed Aug  2 03:45:33 -8882721
Listed

WKM-fs:/ $ rm file1
Server response: Removed

WKM-fs:/ $ ls
Server response: Dir Valid dir1 0 Wed Aug  2 03:45:33 -8882721
Listed

WKM-fs:/ $ cd dir1
Server response: Changed

WKM-fs:/dir1 $ mkdir dir2
Server response: Created

WKM-fs:/dir1 $ cd dir2
Server response: Changed

WKM-fs:/dir1/dir2 $ mkdir dir3
Server response: Created

WKM-fs:/dir1/dir2 $ cd dir3
Server response: Changed

WKM-fs:/dir1/dir2/dir3 $ mk abc
Server response: Created

WKM-fs:/dir1/dir2/dir3 $ w abc 5 hello
Server response: Written

WKM-fs:/dir1/dir2/dir3 $ i abc 1 4 math
Server response: Inserted

WKM-fs:/dir1/dir2/dir3 $ cat abc
Server response: hmathelloRead

WKM-fs:/dir1/dir2/dir3 $ d abc 1 4
Server response: Deleted

WKM-fs:/dir1/dir2/dir3 $ cat abc
Server response: helloRead

WKM-fs:/dir1/dir2/dir3 $ cd ..
Server response: Changed

WKM-fs:/dir1/dir2 $ cd .
Server response: Changed

WKM-fs:/dir1/dir2 $ cd /
Server response: Changed

WKM-fs:/ $ cd /dir1/dir2/dir3
Server response: Changed

WKM-fs:/dir1/dir2/dir3 $ rm abc  
Server response: Removed

WKM-fs:/dir1/dir2/dir3 $ cd .. 
Server response: Changed

WKM-fs:/dir1/dir2 $ rm dir3
Server response: File not found
Failed to remove

WKM-fs:/dir1/dir2 $ rmdir dir3
Server response: Removed

WKM-fs:/dir1/dir2 $ ls
Server response: Listed

WKM-fs:/dir1/dir2 $ e
Server response: By
```

**Read** is to show the end of the read content

we can see it satisfy all the commands, and can write/insert content with space, cd to direct or indirect path. Also if you type e, the FS and BDS will exit at the same time. And when you restart the 3 program, you do not need to format again, and these files and dirs will still in the disk.

a little shortcome is that due to the design of inode, I use uint_32 to store the time and print only the seconds since 1970 but then I learn that ctime can print the time in the common type, like Sat Feb 13 06:50:28, however ,it needs 64 bit time_t, so when you use "ls", the time will be a little confusing. And if I modify the bit width of mtime, the whole inode will need to be modified, so I retain this little bug.

## error detection

if you type the wrong command to lanuch these programs, it will alarm you the right type:

```shell
Usage: ./BDS <DiskFileName> <#cylinders> <#sector per cylinder> <track-to-track delay> <port=10356>

Usage: ./FS <DiskServerAddress> <BDSPort=10356> <FSPort=12356>

Usage: ./FC <ServerAddr> <FSPort=12356>
```

if you type wrong command to the client, it will also alarm you:

```shell
WKM-fs:/ $ f askfj
Server response: Invalid command

WKM-fs:/ $ ffff
Server response: Invalid command

WKM-fs:/ $ mk
Server response: Invalid command: Missing filename

WKM-fs:/ $ ls asdfs
Server response: Invalid command

WKM-fs:/ $ cd    
Server response: Invalid command

WKM-fs:/ $ cd dir1 234234
Server response: Invalid command

WKM-fs:/ $ i
Server response: Invalid command

WKM-fs:/ $ d asfda
Server response: Invalid command

WKM-fs:/ $ w abc 5 
Server response: Invalid command
```

the above content shows that it can detect wrong command head and wrong command token numbers.

if you cd to a dir that not exists:

```shell
WKM-fs:/ $ cd dir123
Server response: Dir not found
Failed to change
```

if you make a file or dir with repeated name:

```shell
WKM-fs:/ $ mkdir dir1
Server response: Dir already exists
Failed to create
```

# step3

## lanuch

you can lanuch 3 programs like step2

```shell
/BDS <DiskFileName> <#cylinders> <#sector per cylinder> <track-to-track delay> <port=10356>

./FS <DiskServerAddress> <BDSPort=10356> <FSPort=12356>

./FC <ServerAddr> <FSPort=12356>
```

or you can test multi users with more client terminal

## register & login & delete user & list user & logout

since step3 is for multi users, after every client connected to the FS, the first stage is register & login & delete user & list user & logout with adminstrator identification. 

```shell
Connected to FS. Type commands to register or login:
register <username> <password>
login <username> <password>
list_users
delete_user <username>
logout
```

then you can register & login & delete user & list user & logout:

```shell
register wkm 991129
FS response: User registered successfully


register lihua 112233
FS response: User registered successfully

list_users
FS response: admin admin123
wkm 991129
lihua 112233
Listed

login wkm 991129
FS response: Login successful, uid: 1

Logged into FS
WKM-fs:/wkm $ 
```

and then you can use the FS as step2

however, you do not need to format anymore and you can experience the support of multi users:

for example, login another user:

```shell
login lihua 112233
FS response: Login successful, uid: 2

Logged into FS
WKM-fs:/lihua $    
```

and the user wkm created 2 file, one is shared and the other is not:

```shell
WKM-fs:/wkm $ mk personalFile 0
Server response: Created

WKM-fs:/wkm $ mk sharedFile 1
Server response: Created

WKM-fs:/wkm $ w personalFile 5 hello
Server response: Written

WKM-fs:/wkm $ w sharedFile 5 world
Server response: Written

WKM-fs:/wkm $ ls
Server response: File Valid personalFile 5 Sun Jan 19 20:49:13 62473975
File Valid sharedFile 5 Tue Dec 26 07:33:41 71393561
Listed
```

and the other user lihua can only see the shared file:

```shell
WKM-fs:/lihua $ cd ..
Server response: Changed

WKM-fs:/ $ cd wkm
Server response: Changed

WKM-fs:/wkm $ ls
Server response: File Valid sharedFile 5 Tue Dec 26 07:33:41 71393561
Listed

WKM-fs:/wkm $ cat sharedFile
Server response: worldRead

WKM-fs:/wkm $ cat personalFile
Server response: Permission denied
Failed to read

```

they can write or read concurrently due to the semaphore mechanism:

```shell
//lihua client
WKM-fs:/wkm $ i sharedFile 1 4 math
Server response: Inserted

WKM-fs:/wkm $ cat sharedFile
Server response: wmathorldRead

//wkm client
WKM-fs:/wkm $ cat sharedFile
Server response: wmathorldRead
```

use "e" to exit the client and other clients and FS, BDS will still work.

## error detection

beyond the errors included in step2, it will detect error when you register or login etc:

```shell
login 
FS response: Invalid command: Missing username or password

register aaa
FS response: Invalid command: Missing username or password
```

